import numpy as np   #导入numpy库，且命名为np
a=np.array([[8,8,8,7,8],   #array表示数组，本行代码意为调用np下的array将下面的这个数组保存下来
           [9,8,8,8,9],
           [10,9,7,7,8],
           [10,9,8,9,9],
           [10,8,8,8,8]])
# print(a)
# b=[[8,8,8,7,8],  #列表里面的数组类型，不同于numpy的数组类型
#    [9,8,8,8,9],
#    [10,9,7,7,8],
#    [10,8,8,8,8]]
# print(b)
# c=np.random.rand(5,5)  #random.rand（）产生随机数组
# print(c)
# print(a+c)  #矩阵中对应元素进行加法
# print(a+2)
# print(a**2)
a[2,0]=11
a[0][0]=9
print(a)
print(a[0,0])
print(a.T4)
# d=[[8,9,8,0,8],  #列表里面的数组类型，不同于numpy的数组类型
#    [2,8,8,9,9],
#    [3,5,7,7,8],
#    [1,8,8,8,0]]
# print(b+d)   #b+d是指将b 和d进行合并成一个数组